'''
Разработать программу, которая будет:
- Принимать команды по mqtt
- Печатать принятые команды на экран
- Выдавать принятые команды в модель робота (вперед заданное время, назад заданное время, поворот налево, заданное время, поворот направо заданное время, стоп)
- Моделировать движение робота (модель должна содержать информацию о положении x,y, ориентации alpha, 
    скорости движения, скорости поворота, ускорению. Возможны дополнительные параметры – размер колес, 
    скорость поворота левого колеса, скорость поворота правого колеса.)
- Сохранять в файл следующую информацию о роботе в формате csv
    Метка времени с точностью до миллисекунд, x, у, alpha
'''
